narfu-serialize/src/DataProcessors/ЗагрузкаDBF/ЗагрузкаDBF.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаDBF</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеФайла</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПостояльцы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаезда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыезда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Постоялец</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

narfu-serialize/src/Documents/Бронирование/Бронирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бронирование</name>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНомера</name>
    <type>
      <types>CatalogRef.ТипыНомеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Постояльцы</name>
    <attributes>
      <name>Постоялец</name>
      <type>
        <types>CatalogRef.Постояльцы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

narfu-serialize/src/DataProcessors/ЗагрузкаDBF/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл";
		
	Фильтр = "Таблица DBF (*.dbf)| *.dbf";     
	
	Проводник.Фильтр = Фильтр;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);
	
КонецПроцедуры                      

 &НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	 
	 Если ВыбранныеФайлы = Неопределено Тогда
		 Возврат;
	 КонецЕсли;    
	 
	 Объект.ПутьКФайлу = ВыбранныеФайлы[0];
  	
  
 КонецПроцедуры 

&НаКлиенте
 Процедура ПрочитатьФайл(Команда)
	 
	 Объект.ДанныеФайла.Очистить();
	 ПрочитатьФайл_DBF();	
	 
 КонецПроцедуры
  
 &НаКлиенте
 Процедура ПрочитатьФайл_DBF()
 
 	ФайлДБФ = Новый XBase;
    
    ФайлДБФ.ОткрытьФайл(Объект.ПутьКФайлу);
	ФайлДБФ.Кодировка =  КодировкаXBase.OEM;   
		    
	Для Сч = 1 По ФайлДБФ.КоличествоЗаписей() Цикл
		
		ФайлДБФ.Перейти(Сч);
    	
    	НоваяСтрока = Объект.ДанныеФайла.Добавить(); 
		
    	НоваяСтрока.Наименование = ФайлДБФ.Name;
    	НоваяСтрока.Код = ФайлДБФ.Kod;
    	НоваяСтрока.Количество = ФайлДБФ.Quantity;
    	НоваяСтрока.Цена = ФайлДБФ.Price; 
		НоваяСтрока.Описание = ФайлДБФ.Descriptio;
		НоваяСтрока.ФИО = ФайлДБФ.FIO;
		НоваяСтрока.КодПостояльцы = ФайлДБФ.CodeGuest;
		НоваяСтрока.Телефон = ФайлДБФ.Telephone;
		НоваяСтрока.АдресЭлектроннойПочты = ФайлДБФ.Email;
		НоваяСтрока.Пол = ФайлДБФ.Gender;
		НоваяСтрока.ДатаРождения = ФайлДБФ.DateOfBirt;
		НоваяСтрока.Дата = ФайлДБФ.Date; 
		НоваяСтрока.Номер = ФайлДБФ.Number;
		НоваяСтрока.ДатаЗаезда = ФайлДБФ.DateArriva;
		НоваяСтрока.ДатаВыезда = ФайлДБФ.DepartureD;
		НоваяСтрока.ТипНомера = ФайлДБФ.TypeNumber;	
		НоваяСтрока.Постоялец = ФайлДБФ.Lodger;
		
	КонецЦикла;      
	    
    ФайлДБФ.ЗакрытьФайл();
 
КонецПроцедуры  

&НаСервере
Процедура ЗаписатьТипыНомеровНаСервере()
	ФайлДБФ = Новый XBase;
	
	ФайлДБФ.ОткрытьФайл(Объект.ПутьКФайлу);
	ФайлДБФ.Кодировка =  КодировкаXBase.OEM;
			
	Для Сч = 1 По ФайлДБФ.КоличествоЗаписей() Цикл 
		
		ФайлДБФ.Перейти(Сч);
				
		ТипНомера = Справочники.ТипыНомеров.СоздатьЭлемент();			
		
		ТипНомера.Наименование = СокрЛП(ФайлДБФ.Name);
		ТипНомера.Код = ФайлДБФ.Kod;
		ТипНомера.Количество = ФайлДБФ.Quantity;
		ТипНомера.Цена = ФайлДБФ.Price; 
		ТипНомера.Описание = ФайлДБФ.Descriptio;
		
		ТипНомера.Записать();
						
	КонецЦикла;	 
	
	ФайлДБФ.ЗакрытьФайл();      
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПостояльцевНаСервере()
	ФайлДБФ = Новый XBase;
	
	ФайлДБФ.ОткрытьФайл(Объект.ПутьКФайлу);
	ФайлДБФ.Кодировка =  КодировкаXBase.OEM;
			
	Для Сч = 1 По ФайлДБФ.КоличествоЗаписей() Цикл 
		
		ФайлДБФ.Перейти(Сч);
						
		Постоялец = Справочники.Постояльцы.СоздатьЭлемент();
		
		Постоялец.Наименование = ФайлДБФ.FIO;
		Постоялец.Код = ФайлДБФ.CodeGuest;
		Постоялец.Телефон = ФайлДБФ.Telephone;
		Постоялец.АдресЭлектроннойПочты = ФайлДБФ.Email;  
		
		Пол = СокрЛП(ФайлДБФ.ПолучитьЗначениеПоля("Gender"));
		
		Если Пол = "Мужской" Тогда 	
			Постоялец.Пол = Перечисления.ПолФизическихЛиц.Мужской;     
		ИначеЕсли Пол = "Женский" Тогда      
			Постоялец.Пол = Перечисления.ПолФизическихЛиц.Женский; 
		КонецЕсли;

		Постоялец.ДатаРождения = ФайлДБФ.DateOfBirt;
		
		Постоялец.Записать();
						
	КонецЦикла;	 
	
	ФайлДБФ.ЗакрытьФайл();  
КонецПроцедуры

&НаСервере
Процедура ЗаписатьБронированиеНаСервере()
	ФайлДБФ = Новый XBase;
	
	ФайлДБФ.ОткрытьФайл(Объект.ПутьКФайлу);
	ФайлДБФ.Кодировка =  КодировкаXBase.OEM;
			
	Для Сч = 1 По ФайлДБФ.КоличествоЗаписей() Цикл 
		
		ФайлДБФ.Перейти(Сч);
						
		Бронь = Документы.Бронирование.СоздатьДокумент();
		
		Бронь.Дата = ФайлДБФ.Date; 
		Бронь.Номер = ФайлДБФ.Number;
		Бронь.ДатаЗаезда = ФайлДБФ.DateArriva;
		Бронь.ДатаВыезда = ФайлДБФ.DepartureD;  
		
		ТипНомера = СокрЛП(ФайлДБФ.ПолучитьЗначениеПоля("TypeNumber"));	       
		
		Тип = Справочники.ТипыНомеров.НайтиПоКоду(Число(ТипНомера));
		УИН = Тип.УникальныйИдентификатор();
				
		Бронь.ТипНомера = Справочники.ТипыНомеров.ПолучитьСсылку(УИН);     
		
		ФИО = СокрЛП(ФайлДБФ.ПолучитьЗначениеПоля("Lodger"));
		
		Имя = Справочники.Постояльцы.НайтиПоНаименованию(Строка(ФИО)); 
		ИД = Имя.УникальныйИдентификатор();
		
		НоваяСтрока = Бронь.Постояльцы.Добавить();  		
		
		НоваяСтрока.Постоялец = Справочники.Постояльцы.ПолучитьСсылку(ИД);
						
		Бронь.Записать(); 
				
	КонецЦикла;	 
	
	ФайлДБФ.ЗакрытьФайл();  КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьБронирование(Команда) 
	ЗаписатьТипыНомеровНаСервере();
	ЗаписатьПостояльцевНаСервере();
	ЗаписатьБронированиеНаСервере();
КонецПроцедуры
